### Split Strings by Characters using the split() Method

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('chicago.csv').dropna(how = 'all')
data['Department'] = data['Department'].astype('category')
data.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [8]:
print("My name is Prajwal Kumar Bhat".split())
print("My name is-Prajwal Kumar Bhat".split(sep = '-'))
print("My name is-Prajwal Kumar Bhat".split(sep = '-')[0])
print("My name is-Prajwal Kumar Bhat".split(sep = '-')[1])

['My', 'name', 'is', 'Prajwal', 'Kumar', 'Bhat']
['My name is', 'Prajwal Kumar Bhat']
My name is
Prajwal Kumar Bhat

In [31]:
data['Name'].str.split(',').str.get(0).str.title().value_counts().head()

Williams    293
Johnson     244
Smith       241
Brown       185
Jones       183
Name: Name, dtype: int64

In [30]:
data['Position Title'].str.split(' ').str.get(0).value_counts().sum()

32062

In [46]:
data['Name'].str.split(',').str.get(1).str.strip().str.split(' ').str.get(0).value_counts().head()

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

In [52]:
data['Name'].str.split(n = 2, expand = True)

                0          1          2
0          AARON,      ELVIA          J
1          AARON,    JEFFERY          M
2          AARON,     KARINA       None
3          AARON,  KIMBERLEI          R
4            ABAD        JR,  VICENTE M
...           ...        ...        ...
32057    ZYGADLO,    MICHAEL          J
32058   ZYGOWICZ,      PETER          J
32059   ZYMANTAS,       MARK          E
32060  ZYRKOWSKI,      CARLO          E
32061  ZYSKOWSKI,    DARIUSZ       None

[32062 rows x 3 columns]